reddit/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "peter"], ["updated_at", "2023-02-24 17:23:38.363513"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)